Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་གང་ཡིན་པ་དང་། འདོད་པའི་ཁམས་གང་ཡིན་པ་དང་། གཟུགས་ཀྱི་ཁམས་གང་ཡིན་པ་དང་། གཟུགས་མེད་པའི་ཁམས་གང་ཡིན་པ་དང་། དགེ་བའི་ཆོས་གང་ཡིན་པ་དང་། མི་དགེ་བའི་ཆོས་
en: Subhūti, these are the virtuous attributes, the factors conducive to enlightenment, that are held to be gathered and included within the perfection of wisdom, that is to say, the attributes of the śrāvakas, the attributes of the pratyekabuddhas, the attributes of the bodhisattvas, and the attributes of the buddhas. “

source: གང་ཡིན་པ་དང་། ཟག་པ་དང་བཅས་པའི་ཆོས་གང་ཡིན་པ་དང་། ཟག་པ་མེད་པའི་ཆོས་གང་ཡིན་པ་དང་། འཇིག་རྟེན་པའི་ཆོས་གང་ཡིན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་གང་ཡིན་པ་དང་། འདུས་བྱས་ཀྱི་ཆོས་གང་ཡིན་པ་དང་། འདུས་མ་བྱས་ཀྱི་ཆོས་གང་ཡིན་པ་དང་། དེ་བཞིན་གཤེགས་པ་གང་ཡིན་པ་དང་། དེ་བཞིན་གཤེགས་པས་བསྟན་པའི་ཆོས་གང་ཡིན་པ་དང་། འདུལ་བ་གང་ཡིན་པ་དང་། ཆོས་ཀྱི་དབྱིངས་གང་ཡིན་པ་དང་། དེ་བཞིན་ཉིད་གང་ཡིན་པ་དང་། ཡང་དག་པའི་མཐའ་གང་ཡིན་པ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་གང་ཡིན་པ་དང་། མྱ་ངན་ལས་འདས་པའི་དབྱིངས་གང་ཡིན་པའི་ཆོས་དེ་དག་ཐམས་ཅད་ནི་ལྡན་པ་ཡང་མ་ཡིན། མི་ལྡན་པ་ཡང་མ་ཡིན་ཏེ། གཟུགས་མེད་པ། བསྟན་ཏུ་མེད་པ།
en: If you ask how so, Subhūti, all these attributes include the perfection of wisdom, the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, the perfection of generosity, physical forms, feelings, perceptions, formative predispositions, consciousness, the eyes, sights, visual consciousness, visually compounded sensory contact, feelings due to sensory contact that is visually compounded, the ears, sounds, auditory consciousness, aurally compounded sensory contact, feelings due to sensory contact that is aurally compounded, the nose, odors, olfactory consciousness, nasally compounded sensory contact, feelings due to sensory contact that is nasally compounded, the tongue, tastes, gustatory consciousness, lingually compounded sensory contact, feelings due to sensory contact that is lingually compounded, the body, tangibles, tactile consciousness, corporeally compounded sensory contact, feelings due to sensory contact that is corporeally compounded, the mental faculty, mental phenomena, mental consciousness, mentally compounded sensory contact, feelings due to sensory contact that is mentally compounded, ignorance, formative predispositions, consciousness, name and form, the six sense fields, sensory contact, sensation, craving, grasping, the rebirth process, actual birth, aging and death, the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, the perfection of wisdom, the emptiness of internal phenomena, the emptiness of external phenomena, the emptiness of external and internal phenomena, [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the noble eightfold path, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the six extrasensory powers, the eight sense fields of mastery, the ten sense fields of complete suffusion, the eight aspects of liberation, the nine serial steps of meditative absorption, suffering, the cause of suffering, the cessation [of suffering], the path [leading to the cessation of suffering], the gateways to liberation—emptiness, signlessness, and wishlessness—the meditative stabilities, the dhāraṇī gateways, {Dt.244} the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great compassion, the eighteen distinct qualities of the buddhas, the realm of desire, the realm of form, the realm of formlessness, virtuous phenomena, nonvirtuous phenomena, contaminated phenomena, uncontaminated phenomena, mundane phenomena, supramundane phenomena, conditioned phenomena, unconditioned phenomena, the tathagātas, the Dharma taught by the tathāgatas, Vinaya, the realm of phenomena, the real nature, the very limit of reality, the inconceivable realm, and the expanse of nirvāṇa—all of these with respect to the Great Vehicle are neither conjoined nor disjoined, and they are immaterial, unrevealed, and unimpeded, their sole defining characteristic being that they are without defining characteristics. “

source: ཐོགས་པ་མྱེད་པ། འདི་ལྟར་མཚན་ཉིད་མེད་པར་མཚན་ཉིད་གཅིག་པ་ཤ་སྟག་སྟེ། རབ་འབྱོར་རྣམ་གྲངས་འདིས་ན། ཁྱོད་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་འཐུན་པར་ཐེག་པ་ཆེན་པོ་སྟོན་ཏོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: These are the ways, Subhūti, in which you do indeed teach the Great Vehicle in conformity with the perfection of wisdom.

source: ཐེག་པ་ཆེན་པོ་ཡང་གཞན་ལ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་གཞན་ཞེས་བྱ་བ་མེད་དེ། དེ་ལྟར་ན་ཐེག་པ་ཆེན་པོ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་དོ། །ཐེག་པ་ཆེན་པོ་ཡང་གཞན་ལ། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: If you ask how so, it is because you do not say that the Great Vehicle is one distinct thing and the perfection of wisdom another; and just so, the Great Vehicle and the perfection of wisdom are indeed not two things and are not to be divided into two.

source: བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་གཞན་ཞེས་བྱ་བ་མེད་དེ། དེ་ལྟར་ན་ཐེག་པ་ཆེན་པོ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་དོ། །ཐེག་པ་ཆེན་པོ་ཡང་གཞན་ལ།
en: You do not say that the Great Vehicle is one distinct thing and the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity another; and just so, the Great Vehicle and the perfection of generosity [and so forth] are indeed not two things and are not to be divided into two.

source: ནང་སྟོང་པ་ཉིད་ཀྱང་གཞན་ཞེས་བྱ་བ་མེད། དངོས་པོ་མྱེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་ཡང་གཞན་ཞེས་བྱ་བ་མེད་དེ། དེ་ལྟར་ན་ཐེག་པ་ཆེན་པོ་དང་། ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ཡང་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་དོ།
en: You do not say that the Great Vehicle is one distinct thing and the emptiness of internal phenomena another, or the [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, another; and just so, the Great Vehicle and the emptiness of internal phenomena and [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are indeed not two things and are not to be divided into two.

source: །ཐེག་པ་ཆེན་པོ་ཡང་གཞན་ལ། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱང་གཞན་ཞེས་བྱ་བ་མེད་དེ། དེ་ལྟར་ན་ཐེག་པ་ཆེན་པོ་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱང་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་དོ། །ཐེག་པ་ཆེན་པོ་ཡང་གཞན་ལ། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཡང་གཞན་ཞེས་བྱ་བ་མེད་དེ། དེ་ལྟར་ན་ཐེག་པ་ཆེན་པོ་དང་། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་།
en: You do not say that the Great Vehicle is one distinct thing and the applications of mindfulness another; and just so, the Great Vehicle and the applications of mindfulness are indeed not two things and are not to be divided into two.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཡང་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་དོ། །ཐེག་པ་ཆེན་པོ་ཡང་གཞན་ལ། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་བ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་།
en: You do not say that the Great Vehicle is one distinct thing and the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path another; and just so, the Great Vehicle and the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path are indeed not two things and are not to be divided into two.

source: ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ཀྱང་གཞན་ཞེས་བྱ་བ་མེད་དེ། དེ་ལྟར་ན་ཐེག་པ་ཆེན་པོ་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ཀྱང་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་དོ། །ཐེག་པ་ཆེན་པོ་ཡང་གཞན་ལ། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ཡང་གཞན།
en: You do not say that the Great Vehicle is one distinct thing and the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways another; and just so, the Great Vehicle and the dhāraṇī gateways [and so forth] are indeed not two things and are not to be divided into two.

source: མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱང་གཞན་ཞེས་བྱ་བ་མེད་དེ། དེ་ལྟར་ན་ཐེག་པ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ཡང་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་དོ།
en: You do not say that the Great Vehicle is one distinct thing and the ten powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the eighteen distinct qualities of the buddhas another; and just so, the Great Vehicle and the distinct qualities of the buddhas [and so forth] are indeed not two things and are not to be divided into two.

source: །རབ་འབྱོར་རྣམ་གྲངས་དེས་ན་ཐེག་པ་ཆེན་པོ་བསྟན་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྟན་པར་འགྱུར་རོ། །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྟན་པས་ཐེག་པ་ཆེན་པོ་བསྟན་པར་འགྱུར་རོ།
en: Those are the formulations, Subhūti, by which you do indeed teach the Great Vehicle by teaching the perfection of wisdom, and you do indeed teach the perfection of wisdom by teaching the Great Vehicle.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ནི་སྔོན་གྱི་མཐར་མི་དམིགས་སོ།
en: Then the venerable Subhūti said to the Blessed One, “Blessed Lord, bodhisattvas do not apprehend the limit of the past.

source: །བྱང་ཆུབ་སེམས་དཔའ་ནི་ཕྱི་མའི་མཐར་མི་དམིགས་སོ།
en: Bodhisattvas do not apprehend the limit of the future.

source: །བྱང་ཆུབ་སེམས་དཔའ་ནི་དབུས་སུ་མི་དམིགས་ཏེ།
en: Bodhisattvas do not apprehend the intervening present.

source: གཟུགས་ཀུན་ཏུ་མཐའ་ཡས་པའི་སླད་དུ། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་མཐའ་ཡས་པར་རིག་པར་བགྱིའོ།
en: One should know that bodhisattvas are beyond all limits because physical forms are beyond all limits.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ཀུན་ཏུ་མཐའ་ཡས་པའི་སླད་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་མཐའ་ཡས་པར་རིག་པར་བགྱི་སྟེ།
en: One should know that bodhisattvas are beyond all limits because feelings, perceptions, formative predispositions, and consciousness are beyond all limits.

source: གཟུགས་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བགྱི་བ་དེ་ལྟ་བུ་ཡང་མ་མཆིས་མི་དམིགས་སོ།
en: Indeed, it cannot be discerned and it cannot be apprehended that physical forms constitute a bodhisattva.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ཞེས་བགྱི་བ་དེ་ལྟ་བུ་ཡང་མ་མཆིས་མི་དམིགས་ཏེ།
en: Indeed, it cannot be discerned and cannot be apprehended that feelings, perceptions, formative predispositions, and consciousness constitute a bodhisattva.

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་བདག་གིས་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དུ་ཐམས་ཅད། རྣམ་པ་ཐམས་ཅད་དུ་ཐམས་ཅད་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་སྟེ་མ་དམིགས་ན། བྱང་ཆུབ་སེམས་དཔའ་གང་ཞིག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གདམས་ཤིང་རྗེས་སུ་བསྟན་པར་བགྱི།
en: Therefore, Blessed Lord, since in all respects, and in each and every way, I do not observe and do not apprehend a bodhisattva, then to what bodhisattvas should I give teaching and instruction in the perfection of wisdom?

source: བྱང་ཆུབ་སེམས་དཔའ་ཉིད་ཀྱང་རིལ་གྱིས་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་མ་དམིགས་ན། བྱང་ཆུབ་སེམས་དཔའ་གང་ཞིག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གདམས་ཤིང་རྗེས་སུ་བསྟན་པར་བགྱི།
en: Since I absolutely do not observe and do not apprehend even the nature of a bodhisattva, then to what bodhisattvas should I give teaching and instruction in the perfection of wisdom? {

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བགྱི་བ་འདི་ནི་མིང་ཙམ་དུ་བས་ཏེ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་བདག་བདག་ཅེས་བགྱི་ཡང་བདག་ལ་མངོན་པར་འགྲུབ་པ་མ་མཆིས་སོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བགྱི་ཡང་། བྱང་ཆུབ་སེམས་དཔའ་ལ་མངོན་པར་འགྲུབ་པ་མ་མཆིས་སོ།
en: Dt.245} “Moreover, Blessed Lord, this ‘bodhisattva’ is a mere name; yet just as one speaks, Blessed Lord, of a self although the self has no coming into being, similarly one speaks, Blessed Lord, of a bodhisattva although bodhisattvas have no coming into being.

source: །དེ་ལྟར་རང་བཞིན་མ་མཆིས་པའི་ཆོས་རྣམས་ལ་གང་མངོན་པར་འགྲུབ་པའི་གཟུགས་ལྟ་ཡང་ག་ལ་ཞིག་མཆིས།
en: So in phenomena that are without inherent existence, what physical form that has come into being—look for it though one might—could there possibly be?

source: གང་མངོན་པར་འགྲུབ་པའི་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ལྟ་ཡང་ག་ལ་ཞིག་མཆིས།
en: What feelings, perceptions, formative predispositions, and consciousness that have come into being—look for them though one might—could there possibly be?

source: བཅོམ་ལྡན་འདས་གང་མངོན་པར་མ་གྲུབ་པ་དེ་ནི། གཟུགས་མ་ལགས།
en: Blessed Lord, something that has not come into being is not a physical form.

source: གང་མངོན་པར་མ་གྲུབ་པ་དེ་ནི་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་མ་ལགས་ཏེ། བཅོམ་ལྡན་འདས་དེ་ལྟ་ལགས་ལ།
en: Something that has not come into being is not feeling, perception, formative predisposition, or consciousness.

source: མངོན་པར་མ་གྲུབ་པ་ལས་གུད་ན་ཡང་གང་བྱང་ཆུབ་ཏུ་སྤྱོད་པར་འགྱུར་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དམིགས་སུ་མ་མཆིས་ན་མངོན་པར་མ་གྲུབ་པ་མངོན་པར་མ་གྲུབ་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གདམས་སུ་མཆིས་སམ།
en: This being the case, Blessed Lord, one cannot apprehend as other than not having come into being those bodhisattva great beings who are engaged in the pursuit of enlightenment. How then should I who have not come into being give instructions in the perfection of wisdom which has also not come into being?

source: གལ་ཏེ་དེ་ལྟར་བསྟན་པའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སེམས་མི་འཇུམ། ཡོངས་སུ་མི་འཇུམ། འགྱོད་པར་མི་འགྱུར་ཞིང་། ཡིད་མི་འཇིགས། མི་སྔང་སྐྲག་པར་མི་འགྱུར་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: If, when such teachings are given, the minds of bodhisattva great beings are not discouraged, not disheartened, not regretful, not frightened, and not terrified, then these bodhisattva great beings are indeed practicing the perfection of wisdom.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཅིའི་ཕྱིར་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྔོན་གྱི་མཐར་དམིགས་སུ་མེད་པ་ཡིན། ཕྱི་མའི་མཐར་དམིགས་སུ་མེད་པ་ཡིན།
en: Then the venerable Śāradvatīputra asked the venerable Subhūti, “Venerable Subhūti, why do bodhisattva great beings not apprehend the limit of the past, not apprehend the limit of the future, and not apprehend the intervening present?

source: དབུས་སུ་དམིགས་སུ་མེད་པ་ཡིན། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཅིའི་ཕྱིར་ན། གཟུགས་ཀུན་ཏུ་མཐའ་ཡས་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་མཐའ་ཡས་པར་རིག་པར་བྱ་བ་ཡིན།
en: Venerable Subhūti, how should one know that bodhisattvas are beyond all limits because physical forms are beyond all limits?

source: ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཀུན་ཏུ་མཐའ་ཡས་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་མཐའ་ཡས་པར་རིག་པར་བྱ་བ་ཡིན།
en: How should one know that bodhisattvas are beyond all limits because feelings, perceptions, formative predispositions, and consciousness are beyond all limits?

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཅིའི་ཕྱིར་ན་གཟུགས་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བ་དེ་ལྟ་བུ་ཡང་མེད་ཅིང་མི་དམིགས་པ་ཡིན།
en: Venerable Subhūti, How is it that physical forms not discerned and how is it that they cannot be apprehended as a bodhisattva?

source: ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བ་དེ་ལྟ་བུ་ཡང་མེད་ཅིང་མི་དམིགས་པ་ཡིན།
en: How is it that feelings, perceptions, formative predispositions, and consciousness are not discerned and how is it that they cannot be apprehended as a bodhisattva?

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཅིའི་ཕྱིར་ན། དེ་སྐད་དུ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐམས་ཅད་དུ་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་དུ་ཐམས་ཅད་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་མ་དམིགས་ན། བྱང་ཆུབ་སེམས་དཔའ་གང་ཞིག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གདམས་ཤིང་རྗེས་སུ་བསྟན་པར་བགྱི་ཞེས་སྨྲ།
en: Venerable Subhūti, why do you say, ‘Since in all respects, and in each and every way, I do not observe and do not apprehend a bodhisattva, then to what bodhisattvas should I give teaching and instruction in the perfection of wisdom’?

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཅིའི་ཕྱིར་ན། དེ་སྐད་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཉིད་ཀྱང་རིལ་གྱིས་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་མ་དམིགས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཞིག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ལ་གདམས་ཤིང་རྗེས་སུ་བསྟན་པར་བགྱི་ཞེས་སྨྲ།
en: Venerable Subhūti, why do you say, ‘Since I absolutely do not observe and do not apprehend even the nature of a bodhisattva, then to what bodhisattvas should I give teaching and instruction in the perfection of wisdom’?

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཅིའི་ཕྱིར་ན། དེ་སྐད་དུ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞེས་བགྱི་བ་འདི་ནི་མིང་ཙམ་དུ་བས་སོ་ཞེས་སྨྲ།
en: Venerable Subhūti, why do you say, ‘Blessed Lord, this “bodhisattva” is a mere name’?

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཅིའི་ཕྱིར་ན། དེ་སྐད་དུ་ཇི་ལྟར་བདག་བདག་ཅེས་བགྱི་བ་ཡང་། བདག་ནི་མངོན་པར་གྲུབ་པ་མ་མཆིས་སོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བགྱི་བ་ཡང་། བྱང་ཆུབ་སེམས་དཔའ་ནི་མངོན་པར་གྲུབ་པ་མ་མཆིས་སོ།
en: Venerable Subhūti, why do you say, ‘Yet just as one speaks, Blessed Lord, of a self although the self has no coming into being, similarly one speaks, Blessed Lord, of a bodhisattva although bodhisattvas have no coming into being.

source: །དེ་ལྟར་ཆོས་ཐམས་ཅད་དངོས་པོ་མ་མཆིས་པའི་རང་བཞིན་ལ། གཟུགས་མངོན་པར་གྲུབ་པ་ལྟ་ཡང་གང་ཞིག་མཆིས།
en: So in phenomena that are without inherent existence, what physical form that has come into being—look for it though one might—could there possibly be?

source: ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་མངོན་པར་གྲུབ་པ་ལྟ་ཡང་གང་ཞིག་མཆིས།
en: What feelings, perceptions, formative predispositions, and consciousness that have come into being—look for them though one might—could there possibly be?

source: གང་མངོན་པར་མ་གྲུབ་པ་དེ་ནི་གཟུགས་མ་ལགས་སོ།
en: Blessed Lord, something that has not come into being is not a physical form.

source: །གང་མངོན་པར་མ་གྲུབ་པ་དེ་ནི་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་མ་ལགས་སོ། །ཞེས་སྨྲ།
en: Something that has not come into being is not feeling, perception, formative predisposition, or consciousness’?

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཅིའི་ཕྱིར་ན། དེ་སྐད་དུ་མངོན་པར་མ་གྲུབ་པ་ཞིག་མངོན་པར་མ་གྲུབ་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གདམས་ཤིང་རྗེས་སུ་བསྟན་པར་བགྱིའམ་ཞེས་སྨྲ།
en: Venerable Subhūti, why do you say, ‘How then should I who have not come into being give teaching and instruction in the perfection of wisdom which has also not come into being’?

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཅིའི་ཕྱིར་ན། དེ་སྐད་དུ་མངོན་པར་མ་གྲུབ་པ་ལས་གུད་ན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞེས་བགྱི་བ་དམིགས་སུ་མ་མཆིས་སོ་ཞེས་སྨྲ། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཅིའི་ཕྱིར་ན། དེ་སྐད་དུ་གལ་ཏེ་དེ་ལྟར་བསྟན་པའི་ཚེ།
en: Venerable Subhūti, why do you say, ‘One cannot apprehend bodhisattva great beings as other than not having come into being’?

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སེམས་མི་འཇུམ། ཡོངས་སུ་མི་འཇུམ། འགྱོད་པར་མི་འགྱུར་ཞིང་། ཡིད་མི་འཇིགས་མི་སྔང་སྐྲག་པར་མི་འགྱུར་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་ལ་སྤྱོད་དོ་ཞེས་སྨྲ།
en: Venerable Subhūti, why do you say, ‘If when such teachings are given, the minds of bodhisattva great beings are not discouraged, not disheartened, not regretful, not frightened, and not terrified, then these bodhisattva great beings are indeed practicing the perfection of wisdom’?”

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་སེམས་ཅན་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ།
en: The venerable Subhūti replied to the venerable Śāradvatīputra as follows: “Venerable Śāradvatīputra, it is owing to the nonexistence of beings that bodhisattvas do not apprehend the limit of the past.

source: །སེམས་ཅན་སྟོང་པ་དང་། སེམས་ཅན་དབེན་པ་དང་། སེམས་ཅན་རང་བཞིན་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ།
en: It is owing to the emptiness of beings, the voidness of beings, and the lack of inherent existence in beings that bodhisattvas do not apprehend the limit of the past.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་སེམས་ཅན་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ། །སེམས་ཅན་སྟོང་པ་དང་། སེམས་ཅན་དབེན་པ་དང་།
en: Venerable Śāradvatīputra, it is owing to the nonexistence of beings that bodhisattvas do not apprehend the limit of the future.

source: སེམས་ཅན་རང་བཞིན་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཕྱི་མའི་མཐར་མི་དམིགས་སོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་སེམས་ཅན་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ། །སེམས་ཅན་སྟོང་པ་དང་།
en: It is owing to the emptiness of beings, the voidness of beings, and the lack of inherent existence in beings that bodhisattvas do not apprehend the limit of the future.

source: སེམས་ཅན་དབེན་པ་དང་། སེམས་ཅན་རང་བཞིན་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དབུས་སུ་མི་དམིགས་སོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ།
en: Venerable Śāradvatīputra, it is owing to the nonexistence of beings that bodhisattvas do not apprehend the intervening present.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། སེམས་ཅན་མེད་པ་དང་། སེམས་ཅན་སྟོང་པ་དང་། སེམས་ཅན་དབེན་པ་དང་།
en: It is owing to the emptiness of beings, the voidness of beings, and the lack of inherent existence in beings that bodhisattvas do not apprehend the intervening present.

source: སེམས་ཅན་རང་བཞིན་མེད་པ་ལ་སྔོན་གྱི་མཐའ་མི་དམིགས་སོ་ཕྱི་མའི་མཐའ་མི་དམིགས་སོ། །དབུས་སུ་མི་དམིགས་སོ། །སེམས་ཅན་མེད་པ་ཡང་གཞན། སེམས་ཅན་སྟོང་བ་ཡང་གཞན། སེམས་ཅན་དབེན་པ་ཡང་གཞན།
en: If you ask why, Venerable Śāradvatīputra, the limit of the past is not apprehended, the limit of the future is not apprehended, and the intervening present is not apprehended in beings who are nonexistent, beings who are empty, beings who are void, and beings who are without inherent existence.

source: སེམས་ཅན་རང་བཞིན་མེད་པ་ཡང་གཞན་ཞིག་ཡིན་ལ། བྱང་ཆུབ་སེམས་དཔའ་ཡང་གཞན་ཞིག་སྟེ། སྔོན་གྱི་མཐའ་ཡང་གཞན། ཕྱི་མའི་མཐའ་ཡང་གཞན། དབུས་ཀྱང་གཞན་ཞེས་བྱ་བ་མེད་དེ།
en: The nonexistence of beings, the emptiness of beings, the voidness of beings, and the lack of inherent existence in beings are not one distinct thing, and bodhisattvas another, nor are the limit of the past, the limit of the future, and the intervening present distinct things.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན་སེམས་ཅན་མེད་པ་གང་ཡིན་པ་དང་། སེམས་ཅན་སྟོང་བ་གང་ཡིན་པ་དང་། སེམས་ཅན་དབེན་པ་གང་ཡིན་པ་དང་། སེམས་ཅན་རང་བཞིན་མེད་པ་གང་ཡིན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་གང་ཡིན་པ་དང་།
en: Venerable Śāradvatīputra, so it is that nonexistent beings, empty beings, void beings, beings without inherent existence, {Dt.246} bodhisattvas, the limit of the past, the limit of the future, and the intervening present—all of these—are indeed not two things and are not to be divided into two. “

source: སྔོན་གྱི་མཐའ་གང་ཡིན་པ་དང་། ཕྱི་མའི་མཐའ་གང་ཡིན་པ་དང་། དབུས་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་དོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཟུགས་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ།
en: Venerable Śāradvatīputra, owing to the nonexistence of physical forms, bodhisattvas do not apprehend the limit of the past.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་མཐར་མི་དམིགས་སོ།
en: Owing to the nonexistence of feelings, perceptions, formative predispositions, and consciousness, bodhisattvas do not apprehend the limit of the past.
